Taxi/test_get_docs_on_antifraud/doc_with_subvention_payment_if_fraud_expected_docs.json

[
  {
    "$antifraud_document": {
      "data": {
        "base_doc_id": 1234567,
        "driver_income": {
          "alias_id": "3ba696b11c891ee88c3150aaacba9d19",
          "components": [
            {
              "amount": "-3.0000",
              "currency": "RUB",
              "kind": "driver_fix/fact/commission"
            },
            {
              "amount": "-0.5000",
              "currency": "RUB",
              "kind": "driver_fix/fact/commission/vat"
            }
          ],
          "driver": {
            "db_id": "7ad36bc7560449998acbe2c57a75c293",
            "driver_uuid": "24deba79c4efecc229acdb1e5017296d"
          },
          "order_event_at": "2018-05-11T00:00:00.000000+03:00"
        },
        "event_version": 12345678,
        "payments": [
          {
            "amount": "100",
            "billing_client_id": "billing_client_id",
            "contract_id": "",
            "currency": "RUB",
            "invoice_date": "2019-12-01T21:00:00.000000+00:00",
            "payload": {
              "alias_id": "noorder/d2093905e4659b9abf06be7231bc4d",
              "billing_client_id": "billing_client_id",
              "detailed_product": "driver_fix_commission_for_fraud",
              "due": "2018-05-11T00:00:00.000000+03:00",
              "order_id": "noorder/d2093905e4659b9abf06be7231bc4d",
              "payload": {
                "amount_details": {
                  "base_amount": "3.0000",
                  "base_currency": "RUB",
                  "contract_currency_rate": "1.00000",
                  "vat": "0.5000"
                },
                "base_doc_id": 1234567,
                "driver_details": {
                  "clid": "clid",
                  "db_id": "db_id",
                  "uuid": "uuid"
                }
              },
              "payment_type": "driver_fix",
              "product": "commission",
              "transaction_type": "payment"
            },
            "payment_kind": "commission/driver_fix"
          }
        ],
        "schema_version": "v3",
        "topic_begin_at": "2018-05-09T00:00:00.000000+03:00"
      },
      "event_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "external_event_ref": "taxi/commission/3ba696b11c891ee88c3150aaacba9d19/12345678",
      "external_obj_id": "taxi/commission/3ba696b11c891ee88c3150aaacba9d19",
      "kind": "commission",
      "process_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "status": "new",
      "tags": []
    }
  },
  {
    "$antifraud_document": {
      "data": {
        "base_doc_id": 1234567,
        "driver_income": {
          "alias_id": "3ba696b11c891ee88c3150aaacba9d19",
          "components": [],
          "driver": {
            "db_id": "7ad36bc7560449998acbe2c57a75c293",
            "driver_uuid": "24deba79c4efecc229acdb1e5017296d"
          },
          "order_event_at": "2018-05-11T00:00:00.000000+03:00"
        },
        "event_version": 12345678,
        "payments": [],
        "schema_version": "v3",
        "topic_begin_at": "2018-05-09T00:00:00.000000+03:00"
      },
      "event_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "external_event_ref": "taxi/subvention/3ba696b11c891ee88c3150aaacba9d19/12345678",
      "external_obj_id": "taxi/subvention/3ba696b11c891ee88c3150aaacba9d19",
      "kind": "subvention",
      "process_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "status": "new",
      "tags": []
    }
  },
  {
    "$antifraud_document": {
      "data": {
        "base_doc_id": 1234567,
        "driver_income": {
          "alias_id": "3ba696b11c891ee88c3150aaacba9d19",
          "components": [],
          "driver": {
            "db_id": "7ad36bc7560449998acbe2c57a75c293",
            "driver_uuid": "24deba79c4efecc229acdb1e5017296d"
          },
          "order_event_at": "2018-05-11T00:00:00.000000+03:00"
        },
        "event_version": 12345678,
        "payments": [],
        "schema_version": "v3",
        "topic_begin_at": "2018-05-09T00:00:00.000000+03:00"
      },
      "event_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "external_event_ref": "taxi/promocode/3ba696b11c891ee88c3150aaacba9d19/12345678",
      "external_obj_id": "taxi/promocode/3ba696b11c891ee88c3150aaacba9d19",
      "kind": "promocode",
      "process_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "status": "new",
      "tags": []
    }
  },
  {
    "$antifraud_document": {
      "data": {
        "base_doc_id": 1234567,
        "driver_income": {
          "alias_id": "3ba696b11c891ee88c3150aaacba9d19",
          "components": [
            {
              "amount": "1000.0000",
              "currency": "RUB",
              "kind": "driver_fix/payout"
            }
          ],
          "driver": {
            "db_id": "7ad36bc7560449998acbe2c57a75c293",
            "driver_uuid": "24deba79c4efecc229acdb1e5017296d"
          },
          "order_event_at": "2018-05-11T00:00:00.000000+03:00"
        },
        "event_version": 12345678,
        "payments": [],
        "schema_version": "v3",
        "topic_begin_at": "2018-05-09T00:00:00.000000+03:00"
      },
      "event_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "external_event_ref": "12345678",
      "external_obj_id": "taxi/payout/driver_fix/3ba696b11c891ee88c3150aaacba9d19",
      "kind": "driver_fix_payout",
      "process_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "status": "new",
      "tags": []
    }
  },
  {
    "$antifraud_document": {
      "data": {
        "base_amount": "20000",
        "commission_at": "2018-05-11T00:00:00.000000+03:00",
        "currency": "RUB",
        "driver": {
          "driver_uuid": "24deba79c4efecc229acdb1e5017296d",
          "park_id": "7ad36bc7560449998acbe2c57a75c293"
        },
        "driver_work_mode": "driver_fix",
        "event_version": 12345678,
        "schema_version": "v1"
      },
      "event_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "external_event_ref": "taxi/park_commission/3ba696b11c891ee88c3150aaacba9d19/12345678",
      "external_obj_id": "taxi/park_commission/3ba696b11c891ee88c3150aaacba9d19",
      "journal_entries": [],
      "kind": "park_commission",
      "process_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "status": "new",
      "tags": []
    }
  },
  {
    "$antifraud_document": {
      "data": {},
      "event_at": {
        "$datetime": "2018-05-11T00:00:00.000000+03:00"
      },
      "external_event_ref": "12345678",
      "external_obj_id": "taxi/driver_fix_income_journal/3ba696b11c891ee88c3150aaacba9d19",
      "journal_entries": [
        {
          "account_id": 0,
          "amount": "20",
          "event_at": "2018-05-11T00:00:00.000000+03:00"
        }
      ],
      "kind": "driver_fix_income_journal",
      "process_at": {
        "$datetime": "2018-11-30T19:31:35.000000+00:00"
      },
      "status": "new",
      "tags": []
    }
  }
]
